{
    "events": {
        "upcoming": [
          {
            "name": "Artificial Intelligence at Waterstons",
            "short_name": "ai_waterstons",
            "date": "6<sup>th</sup> February 2019",
            "image_url": "/img/events/ai_waterstons.png",
            "more_info_url": "https://www.facebook.com/events/294134691142826/",
            "text": [
              "We are seeing AI everywhere in technology, from taking better pictures on your phone, to self-driving cars. Waterstons present an introduction to AI, through everyone’s favourite game: Rock, Paper, Scissors, Waterbomb, Dynamite.",
              "Compete in teams to build the ultimate game playing AI, and then challenge the other teams’ AIs to see who has mastered the game.",
              "Waterstons developers will be on hand to help you learn how to code the AI, setup, and deploy. Any programming language will be suitable."
            ]
          }
        ],
        "past": [
            {
                "name": "American Express - Web Dev and Deployment",
                "short_name": "amex",
                "date": "23<sup>rd</sup> January 2019",
                "image_url": "/img/events/amex.png",
                "more_info_url": "https://www.facebook.com/events/242934183268890/",
                "text": [
                  "Having your own personal website can be a great way to stand out from the crowd.",
                  "The aim of the workshop is to give attendees the tools to build and deploy their very own website. We’ll cover some examples, what to include, popular technologies and deployment methods.",
                  "Whether you already have your own website and are simply looking to get it online or you haven’t even begun, we’ll have something useful for you! The session will consist of a short introduction, followed by hands-on help from American Express demonstrators."
                ]
            },
            {
                "name": "Afternoon with Arista – HPC in Industry",
                "short_name": "arista",
                "date": "28<sup>th</sup> November 2018",
                "image_url": "/img/events/arista.jpg",
                "more_info_url": "https://www.facebook.com/events/269230507111831/",
                "text": [
                    "A workshop associated with HPC in industry, followed later by a career talk on what to expect from employers, internships, interviews, and your first few months in the industry."
                ]
            },
            {
                "name": "DurHack 2018",
                "short_name": "dh18",
                "date": "17<sup>th</sup>–18<sup>th</sup> November 2018",
                "image_url": "/img/events/events_dh18_dark.png",
                "text": [
                    "DurHack is back! Join us from <b>17<sup>th</sup>–18<sup>th</sup> November 2018</b> at the <b>Calman Learning Centre</b> for the third edition of DurHack. This year, <b>150</b> hackers from Durham and around the world will be pushing the boundaries of technology to new limits.",
                    "See <a href=\"https://durhack.com\">durhack.com</a> for tickets and more information."
                ]
            },
            {
                "name": "Scott Logic Coding Challenge",
                "short_name": "slcc",
                "date": "3<sup>rd</sup> November 2018",
                "image_url": "/img/events/slcc.png",
                "more_info_url": "https://www.facebook.com/events/247433799281385/",
                "text": [
                    "Scott Logic hosted an AI coding challenge in <b>E240, Higginson Building</b> at <b>1pm on Saturday 3<sup>rd</sup> November 2018</b> to help students with an interest in software development use their coding skills in a fun challenge. This gave students an opportunity to practise their coding skills and gave them more experience to help boost their CVs.",
                    "The event was open to all Computing Society members. You didn't need to be a Computer Science student to take part, however, having a reasonable working knowledge of Java was helpful.",
                    "The best team, <em>BaddaBing BaddaBoom</em>, won Amazon vouchers!",
                    "There were also several Scott Logic developers there to help. They were very friendly, so chatting with them about what it's like to do their job, and get tips from them to help you start your career in software development, was a great idea.",
                    "<b>What was the coding challenge?</b>",
                    "The code challenge was a turn-based game for AI bots written in Java. At the start of each turn, your bot was provided with the current game state, e.g. map size, your team details and visible food items. Your task was to provide the next move for each of your players so that they could collect food, defend the home base or attack enemy locations. Students had some utility routines at their disposal, e.g. distance between two locations, a basic routing algorithm, but it was up to them how they balanced the activities of their players to maximise their chances of winning.",
                    "Once students had designed and written their bots, they uploaded them to the game server and pitted them against a series of test bots to hone their skills. The final challenge was a battle against bots developed by rival teams.",
                    "<b>What was the format for the afternoon?</b>",
                    "13:00 – Welcome, setup, and introduction to the AI challenge<br />13:30 – Challenge starts<br />17:00 – Challenge finishes, debrief and awarding of prizes<br />Followed by pizza and drinks at <b>The Library</b> bar on <b>Saddler Street</b>",
                    "<b>What were the requirements?</b>",
                    "Students had to bring a laptop with the following software installed:",
                    "<em>Essential:</em><ul><li>JDK (preferably 1.9, but we'll double-check for compatibility), with <code>JAVA_HOME</code> set appropriately</li></ul>",
                    "<em>Recommended:</em><ul><li>Bash, CMD or other terminal</li><li>An IDE (e.g. IntelliJ, NetBeans or Eclipse, a text editor would work but might slow development)</li><li>git (although we can also provide a zip file or other means of accessing the contestant starter kit)</li></ul>"
                ]
            },
            {
                "name": "TPP CompSoc Pub Quiz – October 2018",
                "short_name": "tpp_quiz_oct18",
                "date": "23<sup>rd</sup> October 2018",
                "image_url": "/img/events/events_tpp_pub_quiz.jpg",
                "more_info_url": "https://www.facebook.com/events/353265825415828/",
                "text": [
                    "TPP is excited to announce a Coding Challenge on <b>Tuesday 23<sup>rd</sup> October 2018</b>, in collaboration with CompSoc!",
                    "Unlike a typical pub quiz, you'll need to exercise your problem solving skills to tackle the range of challenges set instead of applying your general knowledge.",
                    "There will be free food and drinks, both soft and alcoholic, available for attendees throughout the whole event. There will also be great prizes on offer for the winning teams (Such as Raspberry Pi computers and a Hotel Chocolat hamper).",
                    "We recommend teams of about 5-6 people, but smaller groups are welcome too, and if you're unsure who to come with then we'll be happy to match you up with other keen problem solvers on the day. Some questions require specific knowledge so you will want a programmer on your team!",
                    "Entry is free of charge and doesn’t require a ticket, so feel free to just show up on the day!"
                ]
            },
            {
                "name": "CompSoc at DSU Freshers Fair 2018",
                "short_name": "ff18",
                "date": "3<sup>rd</sup> October 2018",
                "image_url": "/img/events/ff18.jpg",
                "more_info_url": "https://www.facebook.com/events/194160121380478/",
                "text": [
                    "Join CompSoc at the Freshers Fair to collect freebies and learn more about our activities!",
                    "We’ll be in ER140! Come and join us if you’re interested in tech, computers, programming, or want to learn, and we’ll give you some freebies!"
                ]
            },
            {
                "name": "TPP CompSoc Pub Quiz – June 2018",
                "short_name": "tpp_quiz_jun18",
                "date": "11<sup>th</sup> June 2018",
                "image_url": "/img/events/events_tpp_pub_quiz.jpg",
                "more_info_url": "https://www.facebook.com/events/162858361233386/",
                "text": [
                    "TPP is excited to announce a Coding Challenge on Monday 11th June, in collaboration with CompSoc!",
                    "Unlike a typical pub quiz, you'll need to exercise your problem solving skills to tackle the range of challenges set instead of applying your general knowledge.",
                    "<b>Bring a laptop and your favourite code editor; your programming skills will be tested!</b>",
                    "There will be free food and drinks, both soft and alcoholic, available for attendees throughout the whole event. There will also be great prizes on offer for the winning teams (Raspberry Pi computers and a Hotel Chocolat hamper).",
                    "We recommend teams of about 5-6 people, but smaller groups are welcome too, and if you're unsure who to come with then we'll be happy to match you up with other keen problem solvers on the day. Some questions require specific knowledge so you will want a programmer on your team!",
                    "Entry is free of charge and doesn’t require a ticket, so feel free to just show up on the day!"
                ]
            },
            {
                "name": "Annual General Meeting 2018",
                "short_name": "agm18",
                "date": "12<sup>th</sup> March 2018",
                "image_url": "/img/events/agm_18.png",
                "more_info_url": "https://www.facebook.com/events/2172930349611497/",
                "text": [
                    "We're recruiting new people to run CompSoc. Exec roles are held from the end of the AGM in March 2018 to the end of the AGM in March 2019. Enthusiasm, commitment and perseverance will be needed for all of these roles. However, they are excellent additions to your CV and you will gain a lot of experience working with companies and sponsors in a corporate manner, and you will add a lot of professional skills to your skill set."
                ]
            },
            {
                "name": "TPP CompSoc Pub Quiz – February 2018",
                "short_name": "tpp_quiz_feb18",
                "date": "27<sup>th</sup> February 2018",
                "image_url": "/img/events/events_tpp_pub_quiz.jpg",
                "more_info_url": "https://www.facebook.com/events/2030221730580619/",
                "text": [
                    "Come and join TPP and CompSoc at The Boat Club by Elvet Bridge on 27th February 2018 and test your programming skills in our Pub Quiz. Bring a laptop and your favourite code editor – your problem-solving skills will be tested! Free food, beer, and soft drinks will be provided for all students. We’ll also be giving away great prizes such as Raspberry Pis and Amazon vouchers. With no entry fee, there’s nothing stopping you from assembling a group (max team size 6) of your most intelligent friends and coming along!"
                ]
            },
            {
                "name": "DurHack 2017",
                "short_name": "dh17",
                "date": "9<sup>th</sup>–10<sup>th</sup> December 2017",
                "image_url": "/img/events/events_durhack_2.jpg",
                "more_info_url": "/durhack",
                "text": [
                    "CompSoc brought back <a href=\"http://durhack.tech\">DurHack</a> for a second year running and it was a huge success. With <a href=\"http://www.durham.gov.uk/\">Durham County Council</a>, <a href=\"https://jobs.barclays.co.uk/\">Barclays</a>, <a href=\"https://tpptop50.com\">TPP</a>, <a href=\"https://get.tech\">.TECH Domains</a>, <a href=\"https://www.waterstons.com/careers\">Waterstons</a>, <a href=\"http://www.entrepreneursdurham.co.uk/\">Entrepreneurs Durham</a>, <a href=\"http://www.keyboardco.com\">The Keyboard Company</a>, the <a href=\"https:///www.dur.ac.uk/computer.science\">Department of Computer Science</a> and <a href=\"https://www.durhamsu.com\">Durham Students' Union</a> on board as sponsors, this event was jam-packed with prizes and was not a hackathon to be missed!"
                ]
            },
            {
                "name": "THG Company Presentation and Drinks",
                "short_name": "thg",
                "date": "24<sup>th</sup> October 2017",
                "image_url": "/img/events/thg.png",
                "more_info_url": "https://www.facebook.com/events/325627244576664/",
                "text": [
                    "Join THG at 18:00 on 24th October 2017 at ER152, Elvet Riverside, to know more about their company and careers with them, followed by drinks."
                ]
            },
            {
                "name": "DurHack",
                "short_name": "dh1",
                "date": "28<sup>th</sup>–29<sup>th</sup> January 2017",
                "image_url": "/img/events/events_Durhack_2017.png",
                "more_info_url": "/durhack",
                "text": [
                    "Durham University had its first ever 24-hour hackathon sponsored by big names like Durham County Council, GitHub, MLH, Sunderland Software City, Durham Students' Union, Entrepreneurs Durham, Waterstons, Barclays, Microsoft and Durham University. With enormous data sets from in and around Durham, participants from various UK universities utilised it to produce something that can potentially make a difference to the region. 24 hours of coding interspersed with workshops, games, VR, short sleep sprints and awesome food, the event was a massive success."
                ]
            },
            {
                "name": "MLH Local Hack Day",
                "short_name": "lhd",
                "date": "3<sup>rd</sup> December 2016",
                "image_url": "/img/hackday.jpg",
                "more_info_url": "https://localhackday.mlh.io/",
                "text": [
                    "We organised a 12-hour-long event for building, problem-solving, coding and meeting new people on 3rd December 2016, and it turned out to be a great success! :-)"
                ]
            },
            {
                "name": "Build-A-Chatbot!",
                "short_name": "bac",
                "date": "1<sup>st</sup> December 2016",
                "image_url": "/img/buildachatbot.jpg",
                "more_info_url": "https://www.facebook.com/events/1322032881161709/",
                "text": [
                    "Build-A-Chatbot with Joe Nash, Program Manager at GitHub. Joe is a functional programmer and hacker with a passion for developer relations and community building, who joined us for a fun evening on 1st December 2016, learning to build a Facebook chatbot."
                ]
            },
            {
                "name": "Introduction to Coding Workshop",
                "short_name": "icw",
                "date": "29<sup>th</sup> November 2016",
                "image_url": "/img/edcode.jpg",
                "more_info_url": "https://www.facebook.com/events/1890151881207928/",
                "text": [
                    "We held the first session of a weekly Introduction to Coding workshop in collaboration with <a href=\"http://www.entrepreneursdurham.co.uk\">Entrepreneurs Durham</a> on 29th November 2016"
                ]
            },
            {
                "name": "BP Supply and Trading Event",
                "short_name": "bpst",
                "date": "24<sup>th</sup> October 2016",
                "image_url": "/img/about_carousel_3-BP_Supply_And_Trading_2016-17.jpg",
                "more_info_url": "https://www.facebook.com/events/369911576674539/",
                "text": [
                    "The BP Supply and Trading Event was held on 24th October 2016, where Justin Fay from BP enlightened students about their graduate and placement roles and how technology is integrated into BP's business."
                ]
            },
            {
                "name": "Scott Logic Durham University Hackathon",
                "short_name": "slh",
                "date": "4<sup>th</sup> May 2016",
                "image_url": "/img/winners.jpg",
                "more_info_url": "https://www.facebook.com/events/1608529472702814/",
                "text": [
                    "Our sponsors Scott Logic organised a hackathon on 4th May 2016. Another fun event with code, lots of free pizza and beer!"
                ]
            },
            {
                "name": "Dur(h).ac._k",
                "short_name": "dhack",
                "date": "2<sup>nd</sup> March 2016",
                "image_url": "/img/about_carousel_1-Joe_Nash_Durhack_Initial_Talks_Group_Photo_2016-17.jpg",
                "more_info_url": "https://www.facebook.com/events/234166873592041/",
                "text": [
                    "Joe Nash from PayPal talked to the students on 2nd March 2016 about what hackathons are, how they are often misunderstood as attempts to break into systems, and how they are a brilliant opportunity to network with people from all parts of the world, develop new skills and an opportunity to land in a job as well! That's how Joe ended up working at PayPal.",
                    "The students also got introduced to NodeJS."
                ]
            }
        ]
    }
}
